---
type: WallPaint
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 5
tags: [revit-api, class]
---

# WallPaint

`Autodesk.Revit.DB.Visual.WallPaint` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | WallpaintApplication | 2018.1 | `public static string WallpaintApplication { get ; }` |
| Property | WallpaintColor | 2018.1 | `public static string WallpaintColor { get ; }` |
| Property | WallpaintFinish | 2018.1 | `public static string WallpaintFinish { get ; }` |